base/InformationRegisters/ЗаданияКОтражениюСостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКОтражениюСостоянияЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/ЗаданияКОтражениюСостоянияЗаказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет задания в регистр сведений "Задания к отражению состояния заказов".
// 
// Параметры:
//  Задания - ДокументСсылка, Массив из ДокументСсылка - документ или массив документов, которые надо отразит.
//  Действие - Строка - 
//  ТаблицаЗаданий - см. ОтложенныеЗадания.ДобавитьЗаданияВОчередь.ТаблицаЗаданий
//
Процедура ДобавитьЗадания(Задания, Действие = "", ТаблицаЗаданий = Неопределено) Экспорт
	
	Данные = Новый Структура("Документ, Действие");
	
	Если ТипЗнч(Задания) = Тип("Массив") Тогда
		
		Для каждого Задание Из Задания Цикл
			
			Данные.Документ = Задание;
			Данные.Действие = Действие;
			
			ОтложенныеЗадания.ДобавитьЗаданияВОчередь("ЗаданияКОтражениюСостоянияЗаказов", Данные,, ТаблицаЗаданий);
			
		КонецЦикла;
		
	Иначе
		
		Данные.Документ = Задания;
		Данные.Действие = Действие;
		
		ОтложенныеЗадания.ДобавитьЗаданияВОчередь("ЗаданияКОтражениюСостоянияЗаказов", Данные,, ТаблицаЗаданий);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
